---
kind: type
id: T:Autodesk.Revit.DB.Settings
source: html/9aa29bb7-d720-8c97-0ccb-e3e6046c545c.htm
---
# Autodesk.Revit.DB.Settings

The settings object provides access to general components of the Autodesk Revit
application, such as Categories.

## Syntax (C#)
```csharp
public class Settings : APIObject
```